betaflight/betaflight/lib/main/APM32F4/Libraries/APM32F4xx_DAL_Driver/Source/apm32f4xx_dal_hcd.c
/** @addtogroup HCD_Private_Functions
  * @{
  */
/**
  * @brief  Handle Host Channel IN interrupt requests.
  * @param  hhcd HCD handle
  * @param  chnum Channel number.
  *         This parameter can be a value from 1 to 15
  * @retval none
  */
static void HCD_HC_IN_IRQHandler(HCD_HandleTypeDef *hhcd, uint8_t chnum)
{
  USB_OTG_GlobalTypeDef *USBx = hhcd->Instance;
  uint32_t USBx_BASE = (uint32_t)USBx;
  uint32_t ch_num = (uint32_t)chnum;

  uint32_t tmpreg;

  if ((USBx_HC(ch_num)->HCHINT & USB_OTG_HCHINT_AHBERR) == USB_OTG_HCHINT_AHBERR)
  {
    __DAL_HCD_CLEAR_HC_INT(ch_num, USB_OTG_HCHINT_AHBERR);
    hhcd->hc[ch_num].state = HC_XACTERR;
    (void)USB_HC_Halt(hhcd->Instance, (uint8_t)ch_num);
  }
  else if ((USBx_HC(ch_num)->HCHINT & USB_OTG_HCHINT_BABBLE) == USB_OTG_HCHINT_BABBLE)
  {
    __DAL_HCD_CLEAR_HC_INT(ch_num, USB_OTG_HCHINT_BABBLE);
    hhcd->hc[ch_num].state = HC_BBLERR;
    (void)USB_HC_Halt(hhcd->Instance, (uint8_t)ch_num);
  }
  else if ((USBx_HC(ch_num)->HCHINT & USB_OTG_HCHINT_RXTXACK) == USB_OTG_HCHINT_RXTXACK)
  {
    __DAL_HCD_CLEAR_HC_INT(ch_num, USB_OTG_HCHINT_RXTXACK);
  }
  else if ((USBx_HC(ch_num)->HCHINT & USB_OTG_HCHINT_RXSTALL) == USB_OTG_HCHINT_RXSTALL)
  {
    __DAL_HCD_CLEAR_HC_INT(ch_num, USB_OTG_HCHINT_RXSTALL);
    hhcd->hc[ch_num].state = HC_STALL;
    (void)USB_HC_Halt(hhcd->Instance, (uint8_t)ch_num);
  }
  else if ((USBx_HC(ch_num)->HCHINT & USB_OTG_HCHINT_DTOG) == USB_OTG_HCHINT_DTOG)
  {
    __DAL_HCD_CLEAR_HC_INT(ch_num, USB_OTG_HCHINT_DTOG);
    hhcd->hc[ch_num].state = HC_DATATGLERR;
    (void)USB_HC_Halt(hhcd->Instance, (uint8_t)ch_num);
  }
  else if ((USBx_HC(ch_num)->HCHINT & USB_OTG_HCHINT_TERR) == USB_OTG_HCHINT_TERR)
  {
    __DAL_HCD_CLEAR_HC_INT(ch_num, USB_OTG_HCHINT_TERR);
    hhcd->hc[ch_num].state = HC_XACTERR;
    (void)USB_HC_Halt(hhcd->Instance, (uint8_t)ch_num);
  }
  else
  {
    /* ... */
  }

  if ((USBx_HC(ch_num)->HCHINT & USB_OTG_HCHINT_FOVR) == USB_OTG_HCHINT_FOVR)
  {
    (void)USB_HC_Halt(hhcd->Instance, (uint8_t)ch_num);
    __DAL_HCD_CLEAR_HC_INT(ch_num, USB_OTG_HCHINT_FOVR);
  }
  else if ((USBx_HC(ch_num)->HCHINT & USB_OTG_HCHINT_TSFCMPN) == USB_OTG_HCHINT_TSFCMPN)
  {
    if (hhcd->Init.dma_enable != 0U)
    {
      hhcd->hc[ch_num].xfer_count = hhcd->hc[ch_num].XferSize - \
                                    (USBx_HC(ch_num)->HCHTSIZE & USB_OTG_HCHTSIZE_TSFSIZE);
    }

    hhcd->hc[ch_num].state = HC_XFRC;
    hhcd->hc[ch_num].ErrCnt = 0U;
    __DAL_HCD_CLEAR_HC_INT(ch_num, USB_OTG_HCHINT_TSFCMPN);

    if ((hhcd->hc[ch_num].ep_type == EP_TYPE_CTRL) ||
        (hhcd->hc[ch_num].ep_type == EP_TYPE_BULK))
    {
      (void)USB_HC_Halt(hhcd->Instance, (uint8_t)ch_num);
      __DAL_HCD_CLEAR_HC_INT(ch_num, USB_OTG_HCHINT_RXNAK);
    }
    else if ((hhcd->hc[ch_num].ep_type == EP_TYPE_INTR) ||
             (hhcd->hc[ch_num].ep_type == EP_TYPE_ISOC))
    {
      USBx_HC(ch_num)->HCH |= USB_OTG_HCH_ODDF;
      hhcd->hc[ch_num].urb_state = URB_DONE;

#if (USE_DAL_HCD_REGISTER_CALLBACKS == 1U)
      hhcd->HC_NotifyURBChangeCallback(hhcd, (uint8_t)ch_num, hhcd->hc[ch_num].urb_state);
#else
      DAL_HCD_HC_NotifyURBChange_Callback(hhcd, (uint8_t)ch_num, hhcd->hc[ch_num].urb_state);
#endif /* USE_DAL_HCD_REGISTER_CALLBACKS */
    }
    else
    {
      /* ... */
    }

    if (hhcd->Init.dma_enable == 1U)
    {
      if (((hhcd->hc[ch_num].XferSize / hhcd->hc[ch_num].max_packet) & 1U) != 0U)
      {
        hhcd->hc[ch_num].toggle_in ^= 1U;
      }
    }
    else
    {
      hhcd->hc[ch_num].toggle_in ^= 1U;
    }
  }
  else if ((USBx_HC(ch_num)->HCHINT & USB_OTG_HCHINT_TSFCMPAN) == USB_OTG_HCHINT_TSFCMPAN)
  {
    if (hhcd->hc[ch_num].state == HC_XFRC)
    {
      hhcd->hc[ch_num].urb_state = URB_DONE;
    }
    else if (hhcd->hc[ch_num].state == HC_STALL)
    {
      hhcd->hc[ch_num].urb_state = URB_STALL;
    }
    else if ((hhcd->hc[ch_num].state == HC_XACTERR) ||
             (hhcd->hc[ch_num].state == HC_DATATGLERR))
    {
      hhcd->hc[ch_num].ErrCnt++;
      if (hhcd->hc[ch_num].ErrCnt > 2U)
      {
        hhcd->hc[ch_num].ErrCnt = 0U;
        hhcd->hc[ch_num].urb_state = URB_ERROR;
      }
      else
      {
        hhcd->hc[ch_num].urb_state = URB_NOTREADY;

        /* re-activate the channel */
        tmpreg = USBx_HC(ch_num)->HCH;
        tmpreg &= ~USB_OTG_HCH_CHINT;
        tmpreg |= USB_OTG_HCH_CHEN;
        USBx_HC(ch_num)->HCH = tmpreg;
      }
    }
    else if (hhcd->hc[ch_num].state == HC_NAK)
    {
      hhcd->hc[ch_num].urb_state  = URB_NOTREADY;

      /* re-activate the channel */
      tmpreg = USBx_HC(ch_num)->HCH;
      tmpreg &= ~USB_OTG_HCH_CHINT;
      tmpreg |= USB_OTG_HCH_CHEN;
      USBx_HC(ch_num)->HCH = tmpreg;
    }
    else if (hhcd->hc[ch_num].state == HC_BBLERR)
    {
      hhcd->hc[ch_num].ErrCnt++;
      hhcd->hc[ch_num].urb_state = URB_ERROR;
    }
    else
    {
      /* ... */
    }
    __DAL_HCD_CLEAR_HC_INT(ch_num, USB_OTG_HCHINT_TSFCMPAN);

#if (USE_DAL_HCD_REGISTER_CALLBACKS == 1U)
    hhcd->HC_NotifyURBChangeCallback(hhcd, (uint8_t)ch_num, hhcd->hc[ch_num].urb_state);
#else
    DAL_HCD_HC_NotifyURBChange_Callback(hhcd, (uint8_t)ch_num, hhcd->hc[ch_num].urb_state);
#endif /* USE_DAL_HCD_REGISTER_CALLBACKS */
  }
  else if ((USBx_HC(ch_num)->HCHINT & USB_OTG_HCHINT_RXNAK) == USB_OTG_HCHINT_RXNAK)
  {
    if (hhcd->hc[ch_num].ep_type == EP_TYPE_INTR)
    {
      hhcd->hc[ch_num].ErrCnt = 0U;
      (void)USB_HC_Halt(hhcd->Instance, (uint8_t)ch_num);
    }
    else if ((hhcd->hc[ch_num].ep_type == EP_TYPE_CTRL) ||
             (hhcd->hc[ch_num].ep_type == EP_TYPE_BULK))
    {
      hhcd->hc[ch_num].ErrCnt = 0U;

      if (hhcd->Init.dma_enable == 0U)
      {
        hhcd->hc[ch_num].state = HC_NAK;
        (void)USB_HC_Halt(hhcd->Instance, (uint8_t)ch_num);
      }
    }
    else
    {
      /* ... */
    }
    __DAL_HCD_CLEAR_HC_INT(ch_num, USB_OTG_HCHINT_RXNAK);
  }
  else
  {
    /* ... */
  }
}

/**
  * @brief  Handle Host Channel OUT interrupt requests.
  * @param  hhcd HCD handle
  * @param  chnum Channel number.
  *         This parameter can be a value from 1 to 15
  * @retval none
  */
static void HCD_HC_OUT_IRQHandler(HCD_HandleTypeDef *hhcd, uint8_t chnum)
{
  USB_OTG_GlobalTypeDef *USBx = hhcd->Instance;
  uint32_t USBx_BASE = (uint32_t)USBx;
  uint32_t ch_num = (uint32_t)chnum;
  uint32_t tmpreg;
  uint32_t num_packets;

  if ((USBx_HC(ch_num)->HCHINT & USB_OTG_HCHINT_AHBERR) == USB_OTG_HCHINT_AHBERR)
  {
    __DAL_HCD_CLEAR_HC_INT(ch_num, USB_OTG_HCHINT_AHBERR);
    hhcd->hc[ch_num].state = HC_XACTERR;
    (void)USB_HC_Halt(hhcd->Instance, (uint8_t)ch_num);
  }
  else if ((USBx_HC(ch_num)->HCHINT & USB_OTG_HCHINT_RXTXACK) == USB_OTG_HCHINT_RXTXACK)
  {
    __DAL_HCD_CLEAR_HC_INT(ch_num, USB_OTG_HCHINT_RXTXACK);

    if (hhcd->hc[ch_num].do_ping == 1U)
    {
      hhcd->hc[ch_num].do_ping = 0U;
      hhcd->hc[ch_num].urb_state = URB_NOTREADY;
      (void)USB_HC_Halt(hhcd->Instance, (uint8_t)ch_num);
    }
  }
  else if ((USBx_HC(ch_num)->HCHINT & USB_OTG_HCHINT_FOVR) == USB_OTG_HCHINT_FOVR)
  {
    __DAL_HCD_CLEAR_HC_INT(ch_num, USB_OTG_HCHINT_FOVR);
    (void)USB_HC_Halt(hhcd->Instance, (uint8_t)ch_num);
  }
  else if ((USBx_HC(ch_num)->HCHINT & USB_OTG_HCHINT_TSFCMPN) == USB_OTG_HCHINT_TSFCMPN)
  {
    hhcd->hc[ch_num].ErrCnt = 0U;

    /* transaction completed with NYET state, update do ping state */
    if ((USBx_HC(ch_num)->HCHINT & USB_OTG_HCHINT_RXNYET) == USB_OTG_HCHINT_RXNYET)
    {
      hhcd->hc[ch_num].do_ping = 1U;
      __DAL_HCD_CLEAR_HC_INT(ch_num, USB_OTG_HCHINT_RXNYET);
    }
    __DAL_HCD_CLEAR_HC_INT(ch_num, USB_OTG_HCHINT_TSFCMPN);
    hhcd->hc[ch_num].state = HC_XFRC;
    (void)USB_HC_Halt(hhcd->Instance, (uint8_t)ch_num);
  }
  else if ((USBx_HC(ch_num)->HCHINT & USB_OTG_HCHINT_RXNYET) == USB_OTG_HCHINT_RXNYET)
  {
    hhcd->hc[ch_num].state = HC_NYET;
    hhcd->hc[ch_num].do_ping = 1U;
    hhcd->hc[ch_num].ErrCnt = 0U;
    (void)USB_HC_Halt(hhcd->Instance, (uint8_t)ch_num);
    __DAL_HCD_CLEAR_HC_INT(ch_num, USB_OTG_HCHINT_RXNYET);
  }
  else if ((USBx_HC(ch_num)->HCHINT & USB_OTG_HCHINT_RXSTALL) == USB_OTG_HCHINT_RXSTALL)
  {
    __DAL_HCD_CLEAR_HC_INT(ch_num, USB_OTG_HCHINT_RXSTALL);
    hhcd->hc[ch_num].state = HC_STALL;
    (void)USB_HC_Halt(hhcd->Instance, (uint8_t)ch_num);
  }
  else if ((USBx_HC(ch_num)->HCHINT & USB_OTG_HCHINT_RXNAK) == USB_OTG_HCHINT_RXNAK)
  {
    hhcd->hc[ch_num].ErrCnt = 0U;
    hhcd->hc[ch_num].state = HC_NAK;

    if (hhcd->hc[ch_num].do_ping == 0U)
    {
      if (hhcd->hc[ch_num].speed == HCD_DEVICE_SPEED_HIGH)
      {
        hhcd->hc[ch_num].do_ping = 1U;
      }
    }

