betaflight/betaflight/lib/main/APM32F4/Libraries/APM32F4xx_DAL_Driver/Source/apm32f4xx_dal_hcd.c
    (void)USB_HC_Halt(hhcd->Instance, (uint8_t)ch_num);
    __DAL_HCD_CLEAR_HC_INT(ch_num, USB_OTG_HCHINT_RXNAK);
  }
  else if ((USBx_HC(ch_num)->HCHINT & USB_OTG_HCHINT_TERR) == USB_OTG_HCHINT_TERR)
  {
    if (hhcd->Init.dma_enable == 0U)
    {
      hhcd->hc[ch_num].state = HC_XACTERR;
      (void)USB_HC_Halt(hhcd->Instance, (uint8_t)ch_num);
    }
    else
    {
      hhcd->hc[ch_num].ErrCnt++;
      if (hhcd->hc[ch_num].ErrCnt > 2U)
      {
        hhcd->hc[ch_num].ErrCnt = 0U;
        hhcd->hc[ch_num].urb_state = URB_ERROR;

#if (USE_DAL_HCD_REGISTER_CALLBACKS == 1U)
        hhcd->HC_NotifyURBChangeCallback(hhcd, (uint8_t)ch_num, hhcd->hc[ch_num].urb_state);
#else
        DAL_HCD_HC_NotifyURBChange_Callback(hhcd, (uint8_t)ch_num, hhcd->hc[ch_num].urb_state);
#endif /* USE_DAL_HCD_REGISTER_CALLBACKS */
      }
      else
      {
        hhcd->hc[ch_num].urb_state = URB_NOTREADY;
      }
    }
    __DAL_HCD_CLEAR_HC_INT(ch_num, USB_OTG_HCHINT_TERR);
  }
  else if ((USBx_HC(ch_num)->HCHINT & USB_OTG_HCHINT_DTOG) == USB_OTG_HCHINT_DTOG)
  {
    hhcd->hc[ch_num].state = HC_DATATGLERR;
    (void)USB_HC_Halt(hhcd->Instance, (uint8_t)ch_num);
    __DAL_HCD_CLEAR_HC_INT(ch_num, USB_OTG_HCHINT_DTOG);
  }
  else if ((USBx_HC(ch_num)->HCHINT & USB_OTG_HCHINT_TSFCMPAN) == USB_OTG_HCHINT_TSFCMPAN)
  {
    if (hhcd->hc[ch_num].state == HC_XFRC)
    {
      hhcd->hc[ch_num].urb_state  = URB_DONE;
      if ((hhcd->hc[ch_num].ep_type == EP_TYPE_BULK) ||
          (hhcd->hc[ch_num].ep_type == EP_TYPE_INTR))
      {
        if (hhcd->Init.dma_enable == 0U)
        {
          hhcd->hc[ch_num].toggle_out ^= 1U;
        }

        if ((hhcd->Init.dma_enable == 1U) && (hhcd->hc[ch_num].xfer_len > 0U))
        {
          num_packets = (hhcd->hc[ch_num].xfer_len + hhcd->hc[ch_num].max_packet - 1U) / hhcd->hc[ch_num].max_packet;

          if ((num_packets & 1U) != 0U)
          {
            hhcd->hc[ch_num].toggle_out ^= 1U;
          }
        }
      }
    }
    else if (hhcd->hc[ch_num].state == HC_NAK)
    {
      hhcd->hc[ch_num].urb_state = URB_NOTREADY;
    }
    else if (hhcd->hc[ch_num].state == HC_NYET)
    {
      hhcd->hc[ch_num].urb_state  = URB_NOTREADY;
    }
    else if (hhcd->hc[ch_num].state == HC_STALL)
    {
      hhcd->hc[ch_num].urb_state  = URB_STALL;
    }
    else if ((hhcd->hc[ch_num].state == HC_XACTERR) ||
             (hhcd->hc[ch_num].state == HC_DATATGLERR))
    {
      hhcd->hc[ch_num].ErrCnt++;
      if (hhcd->hc[ch_num].ErrCnt > 2U)
      {
        hhcd->hc[ch_num].ErrCnt = 0U;
        hhcd->hc[ch_num].urb_state = URB_ERROR;
      }
      else
      {
        hhcd->hc[ch_num].urb_state = URB_NOTREADY;

        /* re-activate the channel  */
        tmpreg = USBx_HC(ch_num)->HCH;
        tmpreg &= ~USB_OTG_HCH_CHINT;
        tmpreg |= USB_OTG_HCH_CHEN;
        USBx_HC(ch_num)->HCH = tmpreg;
      }
    }
    else
    {
      /* ... */
    }

    __DAL_HCD_CLEAR_HC_INT(ch_num, USB_OTG_HCHINT_TSFCMPAN);

#if (USE_DAL_HCD_REGISTER_CALLBACKS == 1U)
    hhcd->HC_NotifyURBChangeCallback(hhcd, (uint8_t)ch_num, hhcd->hc[ch_num].urb_state);
#else
    DAL_HCD_HC_NotifyURBChange_Callback(hhcd, (uint8_t)ch_num, hhcd->hc[ch_num].urb_state);
#endif /* USE_DAL_HCD_REGISTER_CALLBACKS */
  }
  else
  {
    /* ... */
  }
}

/**
  * @brief  Handle Rx Queue Level interrupt requests.
  * @param  hhcd HCD handle
  * @retval none
  */
static void HCD_RXQLVL_IRQHandler(HCD_HandleTypeDef *hhcd)
{
  USB_OTG_GlobalTypeDef *USBx = hhcd->Instance;
  uint32_t USBx_BASE = (uint32_t)USBx;
  uint32_t pktsts;
  uint32_t pktcnt;
  uint32_t GrxstspReg;
  uint32_t xferSizePktCnt;
  uint32_t tmpreg;
  uint32_t ch_num;

  GrxstspReg = hhcd->Instance->GRXSTSP;
  ch_num = GrxstspReg & USB_OTG_GRXSTSP_EPNUM;
  pktsts = (GrxstspReg & USB_OTG_GRXSTSP_PSTS) >> 17;
  pktcnt = (GrxstspReg & USB_OTG_GRXSTSP_BCNT) >> 4;

  switch (pktsts)
  {
    case GRXSTS_PKTSTS_IN:
      /* Read the data into the host buffer. */
      if ((pktcnt > 0U) && (hhcd->hc[ch_num].xfer_buff != (void *)0))
      {
        if ((hhcd->hc[ch_num].xfer_count + pktcnt) <= hhcd->hc[ch_num].xfer_len)
        {
          (void)USB_ReadPacket(hhcd->Instance,
                               hhcd->hc[ch_num].xfer_buff, (uint16_t)pktcnt);

          /* manage multiple Xfer */
          hhcd->hc[ch_num].xfer_buff += pktcnt;
          hhcd->hc[ch_num].xfer_count += pktcnt;

          /* get transfer size packet count */
          xferSizePktCnt = (USBx_HC(ch_num)->HCHTSIZE & USB_OTG_HCHTSIZE_PCKTCNT) >> 19;

          if ((hhcd->hc[ch_num].max_packet == pktcnt) && (xferSizePktCnt > 0U))
          {
            /* re-activate the channel when more packets are expected */
            tmpreg = USBx_HC(ch_num)->HCH;
            tmpreg &= ~USB_OTG_HCH_CHINT;
            tmpreg |= USB_OTG_HCH_CHEN;
            USBx_HC(ch_num)->HCH = tmpreg;
            hhcd->hc[ch_num].toggle_in ^= 1U;
          }
        }
        else
        {
          hhcd->hc[ch_num].urb_state = URB_ERROR;
        }
      }
      break;

    case GRXSTS_PKTSTS_DATA_TOGGLE_ERR:
      break;

    case GRXSTS_PKTSTS_IN_XFER_COMP:
    case GRXSTS_PKTSTS_CH_HALTED:
    default:
      break;
  }
}

/**
  * @brief  Handle Host Port interrupt requests.
  * @param  hhcd HCD handle
  * @retval None
  */
static void HCD_Port_IRQHandler(HCD_HandleTypeDef *hhcd)
{
  USB_OTG_GlobalTypeDef *USBx = hhcd->Instance;
  uint32_t USBx_BASE = (uint32_t)USBx;
  __IO uint32_t hprt0;
  __IO uint32_t hprt0_dup;

  /* Handle Host Port Interrupts */
  hprt0 = USBx_HPRT0;
  hprt0_dup = USBx_HPRT0;

  hprt0_dup &= ~(USB_OTG_HPORTCSTS_PEN | USB_OTG_HPORTCSTS_PCINTFLG | \
                 USB_OTG_HPORTCSTS_PENCHG | USB_OTG_HPORTCSTS_POVCCHG);

  /* Check whether Port Connect detected */
  if ((hprt0 & USB_OTG_HPORTCSTS_PCINTFLG) == USB_OTG_HPORTCSTS_PCINTFLG)
  {
    if ((hprt0 & USB_OTG_HPORTCSTS_PCNNTFLG) == USB_OTG_HPORTCSTS_PCNNTFLG)
    {
#if (USE_DAL_HCD_REGISTER_CALLBACKS == 1U)
      hhcd->ConnectCallback(hhcd);
#else
      DAL_HCD_Connect_Callback(hhcd);
#endif /* USE_DAL_HCD_REGISTER_CALLBACKS */
    }
    hprt0_dup |= USB_OTG_HPORTCSTS_PCINTFLG;
  }

  /* Check whether Port Enable Changed */
  if ((hprt0 & USB_OTG_HPORTCSTS_PENCHG) == USB_OTG_HPORTCSTS_PENCHG)
  {
    hprt0_dup |= USB_OTG_HPORTCSTS_PENCHG;

    if ((hprt0 & USB_OTG_HPORTCSTS_PEN) == USB_OTG_HPORTCSTS_PEN)
    {
      if (hhcd->Init.phy_itface  == USB_OTG_EMBEDDED_PHY)
      {
#if defined(APM32F405xx) || defined(APM32F407xx) || defined(APM32F415xx) || defined(APM32F417xx) || defined(APM32F465xx)
        if (hhcd->Init.speed == USBH_HS_SPEED)
        {
          if ((hprt0 & USB_OTG_HPORTCSTS_PSPDSEL) == (HPRT0_PRTSPD_LOW_SPEED << 17))
          {
            (void)USB_InitFSLSPClkSel(hhcd->Instance, HCFG_6_MHZ);
          }
          else if ((hprt0 & USB_OTG_HPORTCSTS_PSPDSEL) == (HPRT0_PRTSPD_FULL_SPEED << 17))
          {
            (void)USB_InitFSLSPClkSel(hhcd->Instance, HCFG_48_MHZ);
          }
          else
          {
            (void)USB_InitFSLSPClkSel(hhcd->Instance, HCFG_30_60_MHZ);
          }
        }
        else
        {
          if ((hprt0 & USB_OTG_HPORTCSTS_PSPDSEL) == (HPRT0_PRTSPD_LOW_SPEED << 17))
          {
            (void)USB_InitFSLSPClkSel(hhcd->Instance, HCFG_6_MHZ);
          }
          else
          {
            (void)USB_InitFSLSPClkSel(hhcd->Instance, HCFG_48_MHZ);
          }
        }
#else
        if ((hprt0 & USB_OTG_HPORTCSTS_PSPDSEL) == (HPRT0_PRTSPD_LOW_SPEED << 17))
        {
          (void)USB_InitFSLSPClkSel(hhcd->Instance, HCFG_6_MHZ);
        }
        else
        {
          (void)USB_InitFSLSPClkSel(hhcd->Instance, HCFG_48_MHZ);
        }
#endif /* APM32F405xx || APM32F407xx || APM32F415xx || APM32F417xx || APM32F465xx */
      }
      else
      {
        if (hhcd->Init.speed == HCD_SPEED_FULL)
        {
          USBx_HOST->HFIVL = 60000U;
        }
      }
#if (USE_DAL_HCD_REGISTER_CALLBACKS == 1U)
      hhcd->PortEnabledCallback(hhcd);
#else
      DAL_HCD_PortEnabled_Callback(hhcd);
#endif /* USE_DAL_HCD_REGISTER_CALLBACKS */

    }
    else
    {
#if (USE_DAL_HCD_REGISTER_CALLBACKS == 1U)
      hhcd->PortDisabledCallback(hhcd);
#else
      DAL_HCD_PortDisabled_Callback(hhcd);
#endif /* USE_DAL_HCD_REGISTER_CALLBACKS */
    }
  }

  /* Check for an overcurrent */
  if ((hprt0 & USB_OTG_HPORTCSTS_POVCCHG) == USB_OTG_HPORTCSTS_POVCCHG)
  {
    hprt0_dup |= USB_OTG_HPORTCSTS_POVCCHG;
  }

  /* Clear Port Interrupts */
  USBx_HPRT0 = hprt0_dup;
}

/**
  * @}
  */

/**
  * @}
  */

#endif /* defined (USB_OTG_FS) || defined (USB_OTG_HS) */
#endif /* DAL_HCD_MODULE_ENABLED */

/**
  * @}
  */

/**
  * @}
  */
